src/java/Bpel/CompositeApp1/src/jbiasa/CompositeApp1.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="CompositeApp1"
             xmlns:tns="CompositeApp1" xmlns:ns="http://j2ee.netbeans.org/wsdl/BpelModule1/src/RequestorWSDL" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://j2ee.netbeans.org/wsdl/BpelModule1/src/RequestorWSDL" location="../jbiServiceUnits/BpelModule1/RequestorWSDL.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:RequestorWSDLPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="RequestorWSDLOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="CompositeApp1"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="CompositeApp1"/>
            </output>
        </operation>
    </binding>
    <service name="CompositeApp1Service1">
        <port name="casaPort1" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/CompositeApp1Service1/casaPort1"/>
        </port>
    </service>
</definitions>
